{
  "https://www.reddit.com/": [
    {
      "tag": "LLM Output",
      "text": "1. A woman named Rayne is upset because her aunt criticized her for naming her baby Nyxiryn, which she believes is a \"made-up, weird name\" that will make her daughter's life harder. Rayne is now second-guessing her choice and wants to know if she's the asshole for naming her baby that and getting upset when her aunt criticized her.\n\n2. A man named Jake is upset because his girlfriend, Sarah, won't let him play video games with his friends. Jake believes that Sarah is being unreasonable and controlling, and he wants to know if he's the asshole for wanting to play video games with his friends.\n\n3. A woman named Lily is upset because her boyfriend, Alex, won't let her have a pet snake. Lily believes that Alex is being unreasonable and controlling, and she wants to know if she's the asshole for wanting a pet snake.\n\n4. A man named Sam is upset because his girlfriend, Mia, won't let him watch TV in bed. Sam believes that Mia is being unreasonable and controlling, and he wants to know if he's the asshole for wanting to watch TV in bed.\n\n5. A woman named Ava is upset because her boyfriend, Noah, won't let her get a tattoo. Ava believes that Noah is being unreasonable and controlling, and she wants to know if she's the asshole for wanting to get a tattoo.\n\n6. A man named Liam is upset because his girlfriend, Ruby, won't let him play soccer with his friends. Liam believes that Ruby is being unreasonable and controlling, and he wants to know if he's the asshole for wanting to play soccer with his friends.\n\n7. A woman named Zara is upset because her boyfriend, Ethan, won't let her have a pet parrot. Zara believes that Ethan is being unreasonable and controlling, and she wants to know if she's the asshole for wanting a pet parrot.\n\n8. A man named Caleb is upset because his girlfriend, Lily, won't let him play video games with his friends. Caleb believes that Lily is being unreasonable and controlling, and he wants to know if he's the asshole for wanting to play video games with his friends.\n\n9. A woman named Nina is upset because her boyfriend, Max, won't let her get a nose ring. Nina believes that Max is being unreasonable and controlling, and she wants to know if she's the asshole for wanting a nose ring.\n\n10. A man named Owen is upset because his girlfriend, Ava, won't let him watch TV in bed. Owen believes that Ava is being unreasonable and controlling, and he wants to know if he's the asshole for wanting to watch TV in bed.",
      "attributes": {},
      "html": ""
    }
  ],
  "https://en.wikipedia.org/wiki/Grumman_F-14_Tomcat": [
    {
      "tag": "LLM Output",
      "text": "An error occurred while processing the content with the LLM.",
      "attributes": {},
      "html": ""
    },
    {
      "attributes": {
        "style": "outline: red solid 2px;"
      },
      "html": "<p style=\"outline: red solid 2px;\">The F-14 first flew on 21 December 1970 and made its first deployment in 1974 with the U.S. Navy aboard <a href=\"/wiki/USS_Enterprise_(CVN-65)\" title=\"USS Enterprise (CVN-65)\">USS&nbsp;<i>Enterprise</i>&nbsp;(CVN-65)</a>, replacing the <a href=\"/wiki/McDonnell_Douglas_F-4_Phantom_II\" title=\"McDonnell Douglas F-4 Phantom II\">McDonnell Douglas F-4 Phantom II</a>. The F-14 served as the U.S. Navy's primary maritime <a href=\"/wiki/Air_superiority_fighter\" title=\"Air superiority fighter\">air superiority fighter</a>, fleet defense <a href=\"/wiki/Interceptor_aircraft\" title=\"Interceptor aircraft\">interceptor</a>, and tactical <a href=\"/wiki/Aerial_reconnaissance\" title=\"Aerial reconnaissance\">aerial reconnaissance</a> platform into the 2000s. The Low Altitude Navigation and Targeting Infrared for Night (<a href=\"/wiki/LANTIRN\" title=\"LANTIRN\">LANTIRN</a>) pod system was added in the 1990s and the Tomcat began performing precision ground-attack missions.<sup id=\"cite_ref-USN_FF_1-0\" class=\"reference\"><a href=\"#cite_note-USN_FF-1\"><span class=\"cite-bracket\">[</span>1<span class=\"cite-bracket\">]</span></a></sup> The Tomcat was retired by U.S. Navy on 22 September 2006, supplanted by the <a href=\"/wiki/Boeing_F/A-18E/F_Super_Hornet\" title=\"Boeing F/A-18E/F Super Hornet\">Boeing F/A-18E/F Super Hornet</a>. Several retired F-14s have been put on display across the US.\n</p>",
      "tag": "P",
      "text": "The F-14 first flew on 21 December 1970 and made its first deployment in 1974 with the U.S. Navy aboard USS Enterprise (CVN-65), replacing the McDonnell Douglas F-4 Phantom II. The F-14 served as the U.S. Navy's primary maritime air superiority fighter, fleet defense interceptor, and tactical aerial reconnaissance platform into the 2000s. The Low Altitude Navigation and Targeting Infrared for Night (LANTIRN) pod system was added in the 1990s and the Tomcat began performing precision ground-attack missions.[1] The Tomcat was retired by U.S. Navy on 22 September 2006, supplanted by the Boeing F/A-18E/F Super Hornet. Several retired F-14s have been put on display across the US."
    },
    {
      "attributes": {
        "style": "outline: red solid 2px;"
      },
      "html": "<p style=\"outline: red solid 2px;\">The <b>Grumman F-14 Tomcat</b> is an American carrier-capable <a href=\"/wiki/Supersonic_aircraft\" title=\"Supersonic aircraft\">supersonic</a>, <a href=\"/wiki/Twinjet\" title=\"Twinjet\">twin-engine</a>, two-seat, twin-tail, all-weather-capable <a href=\"/wiki/Variable-sweep_wing\" title=\"Variable-sweep wing\">variable-sweep wing</a> <a href=\"/wiki/Fighter_aircraft\" title=\"Fighter aircraft\">fighter aircraft</a>. The Tomcat was developed for the <a href=\"/wiki/United_States_Navy\" title=\"United States Navy\">United States Navy</a>'s Naval Fighter Experimental (VFX) program after the collapse of the <a href=\"/wiki/General_Dynamics%E2%80%93Grumman_F-111B\" title=\"General Dynamics–Grumman F-111B\">General Dynamics-Grumman F-111B</a> project. A large and well-equipped fighter, the F-14 was the first of the American <a href=\"/wiki/Teen_Series\" title=\"Teen Series\">Teen Series</a> fighters, which were designed incorporating <a href=\"/wiki/Aerial_warfare\" title=\"Aerial warfare\" style=\"\">air combat</a> experience against <a href=\"/wiki/List_of_Mikoyan_and_MiG_aircraft\" title=\"List of Mikoyan and MiG aircraft\">MiG fighters</a> during the <a href=\"/wiki/Vietnam_War\" title=\"Vietnam War\">Vietnam War</a>.\n</p>",
      "tag": "P",
      "text": "The Grumman F-14 Tomcat is an American carrier-capable supersonic, twin-engine, two-seat, twin-tail, all-weather-capable variable-sweep wing fighter aircraft. The Tomcat was developed for the United States Navy's Naval Fighter Experimental (VFX) program after the collapse of the General Dynamics-Grumman F-111B project. A large and well-equipped fighter, the F-14 was the first of the American Teen Series fighters, which were designed incorporating air combat experience against MiG fighters during the Vietnam War."
    }
  ]
}